import pickle

#打包成语列表为二进制文件
#成语列表 = ['行尸走肉', '金蝉脱壳', '百里挑一', '金玉满堂', '背水一战', '霸王别姬', '天上人间', '不吐不快', '海阔天空', '情非得已', '满腹经纶', '兵临城下', '春暖花开', '插翅难逃', '黄道吉日', '天下无双', '偷天换日', '两小无猜', '卧虎藏龙', '珠光宝气', '簪缨世族', '花花公子', '绘声绘影', '国色天香', '相亲相爱', '八仙过海', '金玉良缘', '掌上明珠', '皆大欢喜', '逍遥法外', '生财有道', '极乐世界', '情不自禁', '愚公移山', '魑魅魍魉', '龙生九子', '精卫填海', '海市蜃楼', '高山流水', '卧薪尝胆', '壮志凌云', '金枝玉叶', '四海一家', '穿针引线', '无忧无虑', '无地自容', '三位一体', '落叶归根', '相见恨晚', '惊天动地', '滔滔不绝', '相濡以沫', '长生不死', '原来如此', '女娲补天', '三皇五帝', '万箭穿心', '水木清华', '窈窕淑女', '破釜沉舟', '天涯海角', '牛郎织女', '倾国倾城', '飘飘欲仙', '福星高照', '妄自菲薄', '永无止境', '学富五车', '饮食男女', '英雄豪杰', '国士无双', '塞翁失马', '万家灯火', '石破天惊', '精忠报国', '养生之道', '覆雨翻云', '六道轮回', '鹰击长空', '日日夜夜', '厚德载物', '亡羊补牢', '万里长城', '黄金时代', '出生入死', '一路顺风', '随遇而安', '千军万马', '郑人买履', '棋逢对手', '叶公好龙', '后会无期', '守株待兔', '凤凰于飞', '一生一世', '花好月圆', '世外桃源', '韬光养晦', '画蛇添足', '青梅竹马', '风花雪月', '滥竽充数', '没完没了', '总而言之', '欣欣向荣', '时光荏苒', '差强人意', '好好先生', '无懈可击', '随波逐流', '袖手旁观', '群雄逐鹿', '血战到底', '唯我独尊', '买椟还珠', '龙马精神', '一见钟情', '喜闻乐见', '负荆请罪', '三人成虎', '河东狮吼', '程门立雪', '金戈铁马', '笑逐颜开', '千钧一发', '纸上谈兵', '风和日丽', '邯郸学步', '大器晚成', '庖丁解牛', '甜言蜜语', '雷霆万钧', '浮生若梦', '大开眼界', '汗牛充栋', '百鸟朝凤', '以德服人', '白驹过隙', '难兄难弟', '鬼哭神嚎', '声色犬马', '指鹿为马', '龙争虎斗', '雾里看花', '男大当婚', '未雨绸缪', '南辕北辙', '三从四德', '一丝不挂', '高屋建瓴']
#pickle_file = open(r'C:\Users\lenovo\Desktop\p\成语接龙.pkl','wb')
#pickle.dump(成语列表, pickle_file)
#pickle_file.close()


pickle_file = open(r'C:\Users\lenovo\Desktop\p\成语接龙.pkl', 'rb')
成语列表 = pickle.load(pickle_file)
pickle_file.close()
接龙列表 = []
for 第一个成语 in 成语列表:
    成语列表_备份 = 成语列表
    接龙列表_备份 = []
    接龙列表_备份.append(第一个成语)
    成语列表_备份.remove(第一个成语)
    
    数目变化判断 = 1
    while 数目变化判断 == 1:
        数目变化判断 = 0
        for 下一个成语 in 成语列表_备份:
            if 下一个成语[0] == 接龙列表_备份[-1][-1]:
                接龙列表_备份.append(下一个成语)
                成语列表_备份.remove(下一个成语)
                数目变化判断 = 1
    if len(接龙列表_备份) >= len(接龙列表):
        接龙列表 = 接龙列表_备份

print(接龙列表)

